---
kind: other
id: Methods.T:Autodesk.Revit.DB.InsertableObject
source: html/daa3bfe6-f102-25e1-cd3b-55cf25144c0a.htm
---
# InsertableObject Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.